# 1.Напишите программу, которая будет на вход принимать число N и выводить
# числа от - N до N
# *Примеры:*
#
# - 5 -> -5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5

number = int(input('Введите число:'))
my_lyst = []
for i in range(-number, number + 1 ):
    my_lyst.append(i)
print(my_lyst) # [-5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5]

# for i in my_lyst:
#     print(i, end=', ') # -5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5,

print(*my_lyst) # -5 -4 -3 -2 -1 0 1 2 3 4 5
print(*my_lyst, sep=', ') # -5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5